Microchip-MPLAB-Harmony/wireless_zigbee/driver/zigbee/src/Components/hal/cortexm4/pic32cx/include/hri_aes_e54.h
/**
 * \file
 *
 * \brief SAM AES
 *
 * Copyright (c) 2016-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 */

#ifndef _HRI_AES_E54_H_INCLUDED_
#define _HRI_AES_E54_H_INCLUDED_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdbool.h>
#include <sysTypes.h>
#if defined(__ICCARM__)
#include <pic32cx1012bz25048_fpga.h>
#elif defined (__GNUC__)
#include <xc.h>
#endif

#include <component/aes.h>

#if defined(ENABLE_AES_CRITICAL_SECTIONS)
#define AES_CRITICAL_SECTION_ENTER() CRITICAL_SECTION_ENTER()
#define AES_CRITICAL_SECTION_LEAVE() CRITICAL_SECTION_LEAVE()
#else
#define AES_CRITICAL_SECTION_ENTER()
#define AES_CRITICAL_SECTION_LEAVE()
#endif

typedef uint32_t hri_aes_ciplen_reg_t;
typedef uint32_t hri_aes_ctrla_reg_t;
typedef uint32_t hri_aes_ghash_reg_t;
typedef uint32_t hri_aes_hashkey_reg_t;
typedef uint32_t hri_aes_indata_reg_t;
typedef uint32_t hri_aes_intvectv_reg_t;
typedef uint32_t hri_aes_keyword_reg_t;
typedef uint32_t hri_aes_randseed_reg_t;
typedef uint8_t  hri_aes_ctrlb_reg_t;
typedef uint8_t  hri_aes_databufptr_reg_t;
typedef uint8_t  hri_aes_dbgctrl_reg_t;
typedef uint8_t  hri_aes_intenset_reg_t;
typedef uint8_t  hri_aes_intflag_reg_t;

static inline void hri_aes_set_INTEN_ENCCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTENSET = AES_INTENSET_ENCCMP(1);
}

static inline bool hri_aes_get_INTEN_ENCCMP_bit(const void *const hw)
{
	return ((AES_REGS->AES_INTENSET & AES_INTENSET_ENCCMP(1)) >> AES_INTENSET_ENCCMP_Pos);
}

static inline void hri_aes_write_INTEN_ENCCMP_bit(const void *const hw, bool value)
{
	if (value == 0x0) {
		AES_REGS->AES_INTENCLR = AES_INTENSET_ENCCMP(1);
	} else {
		AES_REGS->AES_INTENSET = AES_INTENSET_ENCCMP(1);
	}
}

static inline void hri_aes_clear_INTEN_ENCCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTENCLR = AES_INTENSET_ENCCMP(1);
}

static inline void hri_aes_set_INTEN_GFMCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTENSET = AES_INTENSET_GFMCMP(1);
}

static inline bool hri_aes_get_INTEN_GFMCMP_bit(const void *const hw)
{
	return ((AES_REGS->AES_INTENSET & AES_INTENSET_GFMCMP(1)) >> AES_INTENSET_GFMCMP_Pos);
}

static inline void hri_aes_write_INTEN_GFMCMP_bit(const void *const hw, bool value)
{
	if (value == 0x0) {
		AES_REGS->AES_INTENCLR = AES_INTENSET_GFMCMP(1);
	} else {
		AES_REGS->AES_INTENSET = AES_INTENSET_GFMCMP(1);
	}
}

static inline void hri_aes_clear_INTEN_GFMCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTENCLR = AES_INTENSET_GFMCMP(1);
}

static inline void hri_aes_set_INTEN_reg(const void *const hw, hri_aes_intenset_reg_t mask)
{
	AES_REGS->AES_INTENSET = mask;
}

static inline hri_aes_intenset_reg_t hri_aes_get_INTEN_reg(const void *const hw, hri_aes_intenset_reg_t mask)
{
	uint8_t tmp;
	tmp = AES_REGS->AES_INTENSET;
	tmp &= mask;
	return tmp;
}

static inline hri_aes_intenset_reg_t hri_aes_read_INTEN_reg(const void *const hw)
{
	return AES_REGS->AES_INTENSET;
}

static inline void hri_aes_write_INTEN_reg(const void *const hw, hri_aes_intenset_reg_t data)
{
	AES_REGS->AES_INTENSET = data;
	AES_REGS->AES_INTENCLR = ~data;
}

static inline void hri_aes_clear_INTEN_reg(const void *const hw, hri_aes_intenset_reg_t mask)
{
	AES_REGS->AES_INTENCLR = mask;
}

static inline bool hri_aes_get_INTFLAG_ENCCMP_bit(const void *const hw)
{
	return (AES_REGS->AES_INTFLAG & AES_INTFLAG_ENCCMP(1)) >> AES_INTFLAG_ENCCMP_Pos;
}

static inline void hri_aes_clear_INTFLAG_ENCCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTFLAG = AES_INTFLAG_ENCCMP(1);
}

static inline bool hri_aes_get_INTFLAG_GFMCMP_bit(const void *const hw)
{
	return (AES_REGS->AES_INTFLAG & AES_INTFLAG_GFMCMP(1)) >> AES_INTFLAG_GFMCMP_Pos;
}

static inline void hri_aes_clear_INTFLAG_GFMCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTFLAG = AES_INTFLAG_GFMCMP(1);
}

static inline bool hri_aes_get_interrupt_ENCCMP_bit(const void *const hw)
{
	return (AES_REGS->AES_INTFLAG & AES_INTFLAG_ENCCMP(1)) >> AES_INTFLAG_ENCCMP_Pos;
}

static inline void hri_aes_clear_interrupt_ENCCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTFLAG = AES_INTFLAG_ENCCMP(1);
}

static inline bool hri_aes_get_interrupt_GFMCMP_bit(const void *const hw)
{
	return (AES_REGS->AES_INTFLAG & AES_INTFLAG_GFMCMP(1)) >> AES_INTFLAG_GFMCMP_Pos;
}

static inline void hri_aes_clear_interrupt_GFMCMP_bit(const void *const hw)
{
	AES_REGS->AES_INTFLAG = AES_INTFLAG_GFMCMP(1);
}

static inline hri_aes_intflag_reg_t hri_aes_get_INTFLAG_reg(const void *const hw, hri_aes_intflag_reg_t mask)
{
	uint8_t tmp;
	tmp = AES_REGS->AES_INTFLAG;
	tmp &= mask;
	return tmp;
}

static inline hri_aes_intflag_reg_t hri_aes_read_INTFLAG_reg(const void *const hw)
{
	return AES_REGS->AES_INTFLAG;
}

static inline void hri_aes_clear_INTFLAG_reg(const void *const hw, hri_aes_intflag_reg_t mask)
{
	AES_REGS->AES_INTFLAG = mask;
}

static inline void hri_aes_write_KEYWORD_reg(const void *const hw, uint8_t index, hri_aes_keyword_reg_t data)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_KEYWORD[index] = data;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_write_INTVECTV_reg(const void *const hw, uint8_t index, hri_aes_intvectv_reg_t data)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_INTVECTV[index] = data;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_SWRST_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_SWRST(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_SWRST_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_SWRST(1)) >> AES_CTRLA_SWRST_Pos;
	return (bool)tmp;
}

