Microchip-MPLAB-Harmony/wireless_zigbee/driver/zigbee/src/Components/hal/cortexm4/pic32cx/include/hri_aes_e54.h
static inline void hri_aes_set_CTRLA_ENABLE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_ENABLE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_ENABLE_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_ENABLE(1)) >> AES_CTRLA_ENABLE_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_ENABLE_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_ENABLE(1);
	tmp |= value << AES_CTRLA_ENABLE_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_ENABLE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_ENABLE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_toggle_CTRLA_ENABLE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA ^= AES_CTRLA_ENABLE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_CIPHER_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_CIPHER(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_CIPHER_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_CIPHER(1)) >> AES_CTRLA_CIPHER_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_CIPHER_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_CIPHER(1);
	tmp |= value << AES_CTRLA_CIPHER_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_CIPHER_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_CIPHER(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_toggle_CTRLA_CIPHER_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA ^= AES_CTRLA_CIPHER(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_STARTMODE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_STARTMODE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_STARTMODE_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_STARTMODE(1)) >> AES_CTRLA_STARTMODE_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_STARTMODE_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_STARTMODE(1);
	tmp |= value << AES_CTRLA_STARTMODE_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_STARTMODE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_STARTMODE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_toggle_CTRLA_STARTMODE_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA ^= AES_CTRLA_STARTMODE(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_LOD_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_LOD(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_LOD_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_LOD(1)) >> AES_CTRLA_LOD_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_LOD_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_LOD(1);
	tmp |= value << AES_CTRLA_LOD_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_LOD_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_LOD(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_toggle_CTRLA_LOD_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA ^= AES_CTRLA_LOD(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_KEYGEN_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_KEYGEN(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_KEYGEN_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_KEYGEN(1)) >> AES_CTRLA_KEYGEN_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_KEYGEN_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_KEYGEN(1);
	tmp |= value << AES_CTRLA_KEYGEN_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_KEYGEN_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_KEYGEN(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_toggle_CTRLA_KEYGEN_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA ^= AES_CTRLA_KEYGEN(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_set_CTRLA_XORKEY_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA |= AES_CTRLA_XORKEY(1);
	AES_CRITICAL_SECTION_LEAVE();
}

static inline bool hri_aes_get_CTRLA_XORKEY_bit(const void *const hw)
{
	uint32_t tmp;
	tmp = AES_REGS->AES_CTRLA;
	tmp = (tmp & AES_CTRLA_XORKEY(1)) >> AES_CTRLA_XORKEY_Pos;
	return (bool)tmp;
}

static inline void hri_aes_write_CTRLA_XORKEY_bit(const void *const hw, bool value)
{
	uint32_t tmp;
	AES_CRITICAL_SECTION_ENTER();
	tmp = AES_REGS->AES_CTRLA;
	tmp &= ~AES_CTRLA_XORKEY(1);
	tmp |= value << AES_CTRLA_XORKEY_Pos;
	AES_REGS->AES_CTRLA = tmp;
	AES_CRITICAL_SECTION_LEAVE();
}

static inline void hri_aes_clear_CTRLA_XORKEY_bit(const void *const hw)
{
	AES_CRITICAL_SECTION_ENTER();
	AES_REGS->AES_CTRLA &= ~AES_CTRLA_XORKEY(1);
	AES_CRITICAL_SECTION_LEAVE();
}

